/*
Задача 10: Напишите программу, которая принимает на вход трёхзначное число
и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1
*/

Console.WriteLine("Введите трёхзначное число: ");
int numb = int.Parse(Console.ReadLine()!);

int dig2 = (numb / 10) % 10;

Console.WriteLine("Вторая цифра числа равна: ");
Console.WriteLine($"{numb} -> {dig2}");